---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowMonolithicSupportCorseGeom
source: html/cb2d79bb-8ba2-3a8e-7e0f-89962bd6050c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowMonolithicSupportCorseGeom Property

"Show Monolithic Support Corse Geometry"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowMonolithicSupportCorseGeom { get; }
```